Tekla Open API Reference for Tekla Structures 2025
BaseLineWithArrowAtEndPointPlacingType Constructor
 Creates a new base line with arrow at end point placing type instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseLineWithArrowAtEndPointPlacingType()
Public Sub New
See Also
Reference
BaseLineWithArrowAtEndPointPlacingType Class
Tekla.Structures.Drawing Namespace